espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32TG11B/Include/efm32tg11b_prs.h
#define PRS_CH_CTRL_SIGSEL_RTCCCCV1                 (_PRS_CH_CTRL_SIGSEL_RTCCCCV1 << 0)             /**< Shifted mode RTCCCCV1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN2                 (_PRS_CH_CTRL_SIGSEL_GPIOPIN2 << 0)             /**< Shifted mode GPIOPIN2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN10                (_PRS_CH_CTRL_SIGSEL_GPIOPIN10 << 0)            /**< Shifted mode GPIOPIN10 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_PCNT0DIR                 (_PRS_CH_CTRL_SIGSEL_PCNT0DIR << 0)             /**< Shifted mode PCNT0DIR for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_VDAC0OPA0                (_PRS_CH_CTRL_SIGSEL_VDAC0OPA0 << 0)            /**< Shifted mode VDAC0OPA0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES2          (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES2 << 0)      /**< Shifted mode LESENSESCANRES2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES10         (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES10 << 0)     /**< Shifted mode LESENSESCANRES10 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSEDEC2              (_PRS_CH_CTRL_SIGSEL_LESENSEDEC2 << 0)          /**< Shifted mode LESENSEDEC2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART0RXDATAV            (_PRS_CH_CTRL_SIGSEL_USART0RXDATAV << 0)        /**< Shifted mode USART0RXDATAV for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART1RXDATAV            (_PRS_CH_CTRL_SIGSEL_USART1RXDATAV << 0)        /**< Shifted mode USART1RXDATAV for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART2RXDATAV            (_PRS_CH_CTRL_SIGSEL_USART2RXDATAV << 0)        /**< Shifted mode USART2RXDATAV for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART3RXDATAV            (_PRS_CH_CTRL_SIGSEL_USART3RXDATAV << 0)        /**< Shifted mode USART3RXDATAV for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_UART0RXDATAV             (_PRS_CH_CTRL_SIGSEL_UART0RXDATAV << 0)         /**< Shifted mode UART0RXDATAV for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER0CC0                (_PRS_CH_CTRL_SIGSEL_TIMER0CC0 << 0)            /**< Shifted mode TIMER0CC0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER1CC0                (_PRS_CH_CTRL_SIGSEL_TIMER1CC0 << 0)            /**< Shifted mode TIMER1CC0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_WTIMER0CC0               (_PRS_CH_CTRL_SIGSEL_WTIMER0CC0 << 0)           /**< Shifted mode WTIMER0CC0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_WTIMER1CC0               (_PRS_CH_CTRL_SIGSEL_WTIMER1CC0 << 0)           /**< Shifted mode WTIMER1CC0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_CM0PICACHEPCMISSESOF     (_PRS_CH_CTRL_SIGSEL_CM0PICACHEPCMISSESOF << 0) /**< Shifted mode CM0PICACHEPCMISSESOF for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_PRSCH3                   (_PRS_CH_CTRL_SIGSEL_PRSCH3 << 0)               /**< Shifted mode PRSCH3 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_RTCCCCV2                 (_PRS_CH_CTRL_SIGSEL_RTCCCCV2 << 0)             /**< Shifted mode RTCCCCV2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN3                 (_PRS_CH_CTRL_SIGSEL_GPIOPIN3 << 0)             /**< Shifted mode GPIOPIN3 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN11                (_PRS_CH_CTRL_SIGSEL_GPIOPIN11 << 0)            /**< Shifted mode GPIOPIN11 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_VDAC0OPA1                (_PRS_CH_CTRL_SIGSEL_VDAC0OPA1 << 0)            /**< Shifted mode VDAC0OPA1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES3          (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES3 << 0)      /**< Shifted mode LESENSESCANRES3 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES11         (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES11 << 0)     /**< Shifted mode LESENSESCANRES11 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSEDECCMP            (_PRS_CH_CTRL_SIGSEL_LESENSEDECCMP << 0)        /**< Shifted mode LESENSEDECCMP for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART0RTS                (_PRS_CH_CTRL_SIGSEL_USART0RTS << 0)            /**< Shifted mode USART0RTS for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART1RTS                (_PRS_CH_CTRL_SIGSEL_USART1RTS << 0)            /**< Shifted mode USART1RTS for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART2RTS                (_PRS_CH_CTRL_SIGSEL_USART2RTS << 0)            /**< Shifted mode USART2RTS for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART3RTS                (_PRS_CH_CTRL_SIGSEL_USART3RTS << 0)            /**< Shifted mode USART3RTS for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_UART0RTS                 (_PRS_CH_CTRL_SIGSEL_UART0RTS << 0)             /**< Shifted mode UART0RTS for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER0CC1                (_PRS_CH_CTRL_SIGSEL_TIMER0CC1 << 0)            /**< Shifted mode TIMER0CC1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER1CC1                (_PRS_CH_CTRL_SIGSEL_TIMER1CC1 << 0)            /**< Shifted mode TIMER1CC1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_WTIMER0CC1               (_PRS_CH_CTRL_SIGSEL_WTIMER0CC1 << 0)           /**< Shifted mode WTIMER0CC1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_WTIMER1CC1               (_PRS_CH_CTRL_SIGSEL_WTIMER1CC1 << 0)           /**< Shifted mode WTIMER1CC1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_PRSCH4                   (_PRS_CH_CTRL_SIGSEL_PRSCH4 << 0)               /**< Shifted mode PRSCH4 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN4                 (_PRS_CH_CTRL_SIGSEL_GPIOPIN4 << 0)             /**< Shifted mode GPIOPIN4 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN12                (_PRS_CH_CTRL_SIGSEL_GPIOPIN12 << 0)            /**< Shifted mode GPIOPIN12 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_VDAC0OPA2                (_PRS_CH_CTRL_SIGSEL_VDAC0OPA2 << 0)            /**< Shifted mode VDAC0OPA2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES4          (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES4 << 0)      /**< Shifted mode LESENSESCANRES4 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES12         (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES12 << 0)     /**< Shifted mode LESENSESCANRES12 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER0CC2                (_PRS_CH_CTRL_SIGSEL_TIMER0CC2 << 0)            /**< Shifted mode TIMER0CC2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER1CC2                (_PRS_CH_CTRL_SIGSEL_TIMER1CC2 << 0)            /**< Shifted mode TIMER1CC2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_WTIMER0CC2               (_PRS_CH_CTRL_SIGSEL_WTIMER0CC2 << 0)           /**< Shifted mode WTIMER0CC2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_WTIMER1CC2               (_PRS_CH_CTRL_SIGSEL_WTIMER1CC2 << 0)           /**< Shifted mode WTIMER1CC2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_PRSCH5                   (_PRS_CH_CTRL_SIGSEL_PRSCH5 << 0)               /**< Shifted mode PRSCH5 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN5                 (_PRS_CH_CTRL_SIGSEL_GPIOPIN5 << 0)             /**< Shifted mode GPIOPIN5 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN13                (_PRS_CH_CTRL_SIGSEL_GPIOPIN13 << 0)            /**< Shifted mode GPIOPIN13 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_VDAC0OPA3                (_PRS_CH_CTRL_SIGSEL_VDAC0OPA3 << 0)            /**< Shifted mode VDAC0OPA3 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES5          (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES5 << 0)      /**< Shifted mode LESENSESCANRES5 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES13         (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES13 << 0)     /**< Shifted mode LESENSESCANRES13 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART0TX                 (_PRS_CH_CTRL_SIGSEL_USART0TX << 0)             /**< Shifted mode USART0TX for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART1TX                 (_PRS_CH_CTRL_SIGSEL_USART1TX << 0)             /**< Shifted mode USART1TX for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART2TX                 (_PRS_CH_CTRL_SIGSEL_USART2TX << 0)             /**< Shifted mode USART2TX for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART3TX                 (_PRS_CH_CTRL_SIGSEL_USART3TX << 0)             /**< Shifted mode USART3TX for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_UART0TX                  (_PRS_CH_CTRL_SIGSEL_UART0TX << 0)              /**< Shifted mode UART0TX for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER1CC3                (_PRS_CH_CTRL_SIGSEL_TIMER1CC3 << 0)            /**< Shifted mode TIMER1CC3 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_WTIMER1CC3               (_PRS_CH_CTRL_SIGSEL_WTIMER1CC3 << 0)           /**< Shifted mode WTIMER1CC3 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_PRSCH6                   (_PRS_CH_CTRL_SIGSEL_PRSCH6 << 0)               /**< Shifted mode PRSCH6 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN6                 (_PRS_CH_CTRL_SIGSEL_GPIOPIN6 << 0)             /**< Shifted mode GPIOPIN6 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN14                (_PRS_CH_CTRL_SIGSEL_GPIOPIN14 << 0)            /**< Shifted mode GPIOPIN14 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES6          (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES6 << 0)      /**< Shifted mode LESENSESCANRES6 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES14         (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES14 << 0)     /**< Shifted mode LESENSESCANRES14 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART0CS                 (_PRS_CH_CTRL_SIGSEL_USART0CS << 0)             /**< Shifted mode USART0CS for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART1CS                 (_PRS_CH_CTRL_SIGSEL_USART1CS << 0)             /**< Shifted mode USART1CS for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART2CS                 (_PRS_CH_CTRL_SIGSEL_USART2CS << 0)             /**< Shifted mode USART2CS for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART3CS                 (_PRS_CH_CTRL_SIGSEL_USART3CS << 0)             /**< Shifted mode USART3CS for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_UART0CS                  (_PRS_CH_CTRL_SIGSEL_UART0CS << 0)              /**< Shifted mode UART0CS for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_PRSCH7                   (_PRS_CH_CTRL_SIGSEL_PRSCH7 << 0)               /**< Shifted mode PRSCH7 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN7                 (_PRS_CH_CTRL_SIGSEL_GPIOPIN7 << 0)             /**< Shifted mode GPIOPIN7 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN15                (_PRS_CH_CTRL_SIGSEL_GPIOPIN15 << 0)            /**< Shifted mode GPIOPIN15 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_CMUCLKOUT2               (_PRS_CH_CTRL_SIGSEL_CMUCLKOUT2 << 0)           /**< Shifted mode CMUCLKOUT2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES7          (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES7 << 0)      /**< Shifted mode LESENSESCANRES7 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES15         (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES15 << 0)     /**< Shifted mode LESENSESCANRES15 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_SHIFT                8                                               /**< Shift value for PRS_SOURCESEL */
#define _PRS_CH_CTRL_SOURCESEL_MASK                 0x7F00UL                                        /**< Bit mask for PRS_SOURCESEL */
#define _PRS_CH_CTRL_SOURCESEL_NONE                 0x00000000UL                                    /**< Mode NONE for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_PRSL                 0x00000001UL                                    /**< Mode PRSL for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_ACMP0                0x00000002UL                                    /**< Mode ACMP0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_ACMP1                0x00000003UL                                    /**< Mode ACMP1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_ADC0                 0x00000004UL                                    /**< Mode ADC0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_RTCC                 0x00000005UL                                    /**< Mode RTCC for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_GPIOL                0x00000006UL                                    /**< Mode GPIOL for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_GPIOH                0x00000007UL                                    /**< Mode GPIOH for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_LETIMER0             0x00000008UL                                    /**< Mode LETIMER0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_PCNT0                0x00000009UL                                    /**< Mode PCNT0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_CRYOTIMER            0x0000000AUL                                    /**< Mode CRYOTIMER for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_CMU                  0x0000000BUL                                    /**< Mode CMU for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_VDAC0                0x00000011UL                                    /**< Mode VDAC0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_LESENSEL             0x00000012UL                                    /**< Mode LESENSEL for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_LESENSEH             0x00000013UL                                    /**< Mode LESENSEH for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_LESENSED             0x00000014UL                                    /**< Mode LESENSED for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_LESENSE              0x00000015UL                                    /**< Mode LESENSE for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_USART0               0x00000020UL                                    /**< Mode USART0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_USART1               0x00000021UL                                    /**< Mode USART1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_USART2               0x00000022UL                                    /**< Mode USART2 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_USART3               0x00000023UL                                    /**< Mode USART3 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_UART0                0x00000024UL                                    /**< Mode UART0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_TIMER0               0x00000025UL                                    /**< Mode TIMER0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_TIMER1               0x00000026UL                                    /**< Mode TIMER1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_WTIMER0              0x00000027UL                                    /**< Mode WTIMER0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_WTIMER1              0x00000028UL                                    /**< Mode WTIMER1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_CM0P                 0x00000029UL                                    /**< Mode CM0P for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_NONE                  (_PRS_CH_CTRL_SOURCESEL_NONE << 8)              /**< Shifted mode NONE for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_PRSL                  (_PRS_CH_CTRL_SOURCESEL_PRSL << 8)              /**< Shifted mode PRSL for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_ACMP0                 (_PRS_CH_CTRL_SOURCESEL_ACMP0 << 8)             /**< Shifted mode ACMP0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_ACMP1                 (_PRS_CH_CTRL_SOURCESEL_ACMP1 << 8)             /**< Shifted mode ACMP1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_ADC0                  (_PRS_CH_CTRL_SOURCESEL_ADC0 << 8)              /**< Shifted mode ADC0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_RTCC                  (_PRS_CH_CTRL_SOURCESEL_RTCC << 8)              /**< Shifted mode RTCC for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_GPIOL                 (_PRS_CH_CTRL_SOURCESEL_GPIOL << 8)             /**< Shifted mode GPIOL for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_GPIOH                 (_PRS_CH_CTRL_SOURCESEL_GPIOH << 8)             /**< Shifted mode GPIOH for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_LETIMER0              (_PRS_CH_CTRL_SOURCESEL_LETIMER0 << 8)          /**< Shifted mode LETIMER0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_PCNT0                 (_PRS_CH_CTRL_SOURCESEL_PCNT0 << 8)             /**< Shifted mode PCNT0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_CRYOTIMER             (_PRS_CH_CTRL_SOURCESEL_CRYOTIMER << 8)         /**< Shifted mode CRYOTIMER for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_CMU                   (_PRS_CH_CTRL_SOURCESEL_CMU << 8)               /**< Shifted mode CMU for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_VDAC0                 (_PRS_CH_CTRL_SOURCESEL_VDAC0 << 8)             /**< Shifted mode VDAC0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_LESENSEL              (_PRS_CH_CTRL_SOURCESEL_LESENSEL << 8)          /**< Shifted mode LESENSEL for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_LESENSEH              (_PRS_CH_CTRL_SOURCESEL_LESENSEH << 8)          /**< Shifted mode LESENSEH for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_LESENSED              (_PRS_CH_CTRL_SOURCESEL_LESENSED << 8)          /**< Shifted mode LESENSED for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_LESENSE               (_PRS_CH_CTRL_SOURCESEL_LESENSE << 8)           /**< Shifted mode LESENSE for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_USART0                (_PRS_CH_CTRL_SOURCESEL_USART0 << 8)            /**< Shifted mode USART0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_USART1                (_PRS_CH_CTRL_SOURCESEL_USART1 << 8)            /**< Shifted mode USART1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_USART2                (_PRS_CH_CTRL_SOURCESEL_USART2 << 8)            /**< Shifted mode USART2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_USART3                (_PRS_CH_CTRL_SOURCESEL_USART3 << 8)            /**< Shifted mode USART3 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_UART0                 (_PRS_CH_CTRL_SOURCESEL_UART0 << 8)             /**< Shifted mode UART0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_TIMER0                (_PRS_CH_CTRL_SOURCESEL_TIMER0 << 8)            /**< Shifted mode TIMER0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_TIMER1                (_PRS_CH_CTRL_SOURCESEL_TIMER1 << 8)            /**< Shifted mode TIMER1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_WTIMER0               (_PRS_CH_CTRL_SOURCESEL_WTIMER0 << 8)           /**< Shifted mode WTIMER0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_WTIMER1               (_PRS_CH_CTRL_SOURCESEL_WTIMER1 << 8)           /**< Shifted mode WTIMER1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_CM0P                  (_PRS_CH_CTRL_SOURCESEL_CM0P << 8)              /**< Shifted mode CM0P for PRS_CH_CTRL */
#define _PRS_CH_CTRL_EDSEL_SHIFT                    20                                              /**< Shift value for PRS_EDSEL */
#define _PRS_CH_CTRL_EDSEL_MASK                     0x300000UL                                      /**< Bit mask for PRS_EDSEL */
#define _PRS_CH_CTRL_EDSEL_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for PRS_CH_CTRL */
#define _PRS_CH_CTRL_EDSEL_OFF                      0x00000000UL                                    /**< Mode OFF for PRS_CH_CTRL */
#define _PRS_CH_CTRL_EDSEL_POSEDGE                  0x00000001UL                                    /**< Mode POSEDGE for PRS_CH_CTRL */
#define _PRS_CH_CTRL_EDSEL_NEGEDGE                  0x00000002UL                                    /**< Mode NEGEDGE for PRS_CH_CTRL */
#define _PRS_CH_CTRL_EDSEL_BOTHEDGES                0x00000003UL                                    /**< Mode BOTHEDGES for PRS_CH_CTRL */
#define PRS_CH_CTRL_EDSEL_DEFAULT                   (_PRS_CH_CTRL_EDSEL_DEFAULT << 20)              /**< Shifted mode DEFAULT for PRS_CH_CTRL */
#define PRS_CH_CTRL_EDSEL_OFF                       (_PRS_CH_CTRL_EDSEL_OFF << 20)                  /**< Shifted mode OFF for PRS_CH_CTRL */
#define PRS_CH_CTRL_EDSEL_POSEDGE                   (_PRS_CH_CTRL_EDSEL_POSEDGE << 20)              /**< Shifted mode POSEDGE for PRS_CH_CTRL */
#define PRS_CH_CTRL_EDSEL_NEGEDGE                   (_PRS_CH_CTRL_EDSEL_NEGEDGE << 20)              /**< Shifted mode NEGEDGE for PRS_CH_CTRL */
#define PRS_CH_CTRL_EDSEL_BOTHEDGES                 (_PRS_CH_CTRL_EDSEL_BOTHEDGES << 20)            /**< Shifted mode BOTHEDGES for PRS_CH_CTRL */
#define PRS_CH_CTRL_STRETCH                         (0x1UL << 25)                                   /**< Stretch Channel Output */
#define _PRS_CH_CTRL_STRETCH_SHIFT                  25                                              /**< Shift value for PRS_STRETCH */
#define _PRS_CH_CTRL_STRETCH_MASK                   0x2000000UL                                     /**< Bit mask for PRS_STRETCH */
#define _PRS_CH_CTRL_STRETCH_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for PRS_CH_CTRL */
#define PRS_CH_CTRL_STRETCH_DEFAULT                 (_PRS_CH_CTRL_STRETCH_DEFAULT << 25)            /**< Shifted mode DEFAULT for PRS_CH_CTRL */
#define PRS_CH_CTRL_INV                             (0x1UL << 26)                                   /**< Invert Channel */
#define _PRS_CH_CTRL_INV_SHIFT                      26                                              /**< Shift value for PRS_INV */
#define _PRS_CH_CTRL_INV_MASK                       0x4000000UL                                     /**< Bit mask for PRS_INV */
#define _PRS_CH_CTRL_INV_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for PRS_CH_CTRL */
#define PRS_CH_CTRL_INV_DEFAULT                     (_PRS_CH_CTRL_INV_DEFAULT << 26)                /**< Shifted mode DEFAULT for PRS_CH_CTRL */
#define PRS_CH_CTRL_ORPREV                          (0x1UL << 27)                                   /**< Or Previous */
#define _PRS_CH_CTRL_ORPREV_SHIFT                   27                                              /**< Shift value for PRS_ORPREV */
#define _PRS_CH_CTRL_ORPREV_MASK                    0x8000000UL                                     /**< Bit mask for PRS_ORPREV */
#define _PRS_CH_CTRL_ORPREV_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for PRS_CH_CTRL */
#define PRS_CH_CTRL_ORPREV_DEFAULT                  (_PRS_CH_CTRL_ORPREV_DEFAULT << 27)             /**< Shifted mode DEFAULT for PRS_CH_CTRL */
#define PRS_CH_CTRL_ANDNEXT                         (0x1UL << 28)                                   /**< And Next */
#define _PRS_CH_CTRL_ANDNEXT_SHIFT                  28                                              /**< Shift value for PRS_ANDNEXT */
#define _PRS_CH_CTRL_ANDNEXT_MASK                   0x10000000UL                                    /**< Bit mask for PRS_ANDNEXT */
#define _PRS_CH_CTRL_ANDNEXT_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for PRS_CH_CTRL */
#define PRS_CH_CTRL_ANDNEXT_DEFAULT                 (_PRS_CH_CTRL_ANDNEXT_DEFAULT << 28)            /**< Shifted mode DEFAULT for PRS_CH_CTRL */
#define PRS_CH_CTRL_ASYNC                           (0x1UL << 30)                                   /**< Asynchronous Reflex */
#define _PRS_CH_CTRL_ASYNC_SHIFT                    30                                              /**< Shift value for PRS_ASYNC */
#define _PRS_CH_CTRL_ASYNC_MASK                     0x40000000UL                                    /**< Bit mask for PRS_ASYNC */
#define _PRS_CH_CTRL_ASYNC_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for PRS_CH_CTRL */
#define PRS_CH_CTRL_ASYNC_DEFAULT                   (_PRS_CH_CTRL_ASYNC_DEFAULT << 30)              /**< Shifted mode DEFAULT for PRS_CH_CTRL */

